{
  "backend/main.mo": "Motoko canister defining profile, post, comment, and follow types with sorting helpers, storage maps, authorization checks, and profile retrieval/update logic.",
  "feature_evidence.json": "Structured feature-evidence report mapping implemented product features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files describing their purpose and role in the app.",
  "frontend/index.css": "Global Tailwind styles defining a coral/peach OKLCH theme with light and dark mode tokens.",
  "frontend/index.html": "HTML entry point loading Inter font and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main application router with authentication gating, profile setup dialog, and routes for feed, posts, creation, and profiles.",
  "frontend/src/components/auth/LoginCard.tsx": "Login screen with branding, Internet Identity sign-in button, and loading state.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting new users to enter display name and bio, saving profiles with a placeholder avatar.",
  "frontend/src/components/comments/CommentComposer.tsx": "Form for writing and submitting comments with validation, character count, and loading state.",
  "frontend/src/components/comments/CommentList.tsx": "Renders a list of comments with avatars, timestamps, and loading/empty states.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, navigation, and user menu handling logout.",
  "frontend/src/components/posts/PostCard.tsx": "Displays a post with image, author info, like toggling, and navigation to the post page.",
  "frontend/src/components/profile/EditProfileDialog.tsx": "Dialog for editing profile info including display name, bio, and profile image upload.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity and refreshes dependent queries.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity auth state and provides login/logout helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, loading stored identities, and handling login state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for profiles, posts, comments, feed, and profile updates using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and applies global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/CreatePostPage.tsx": "Provides a form to upload an image, preview it, enter a caption, and submit a new post with upload progress.",
  "frontend/src/pages/FeedPage.tsx": "Loads and displays an infinite-scrolling feed of posts with loading and empty states.",
  "frontend/src/pages/PostDetailPage.tsx": "Shows a single post with image, caption, likes, comments, and allows liking and navigation back.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user profile with avatar, bio, follower stats, and optional edit dialog for the owner.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, color tokens, fonts, and plugins.",
  "project_state.json": "Defines the project’s current state for building an Instagram‑like app, including required images and a list of implemented features. Contains metadata, versioning, and architectural notes placeholders."
}